Ran Plan for dir: `infra` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.12.1 plan -input=false -refresh -out "/atlantis-data/repos/ed-bogd/devops-task/5/default/infra/default.tfplan"' in '/atlantis-data/repos/ed-bogd/devops-task/5/default/infra': exit status 1
aws_vpc.main: Refreshing state... [id=vpc-0db03f5231cbfa7bd]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
aws_eip.nat_2: Refreshing state... [id=eipalloc-0916ccee51095988c]
data.aws_caller_identity.current: Reading...
aws_iam_user.eks_admin: Refreshing state... [id=eks-admin-user]
aws_eip.nat_1: Refreshing state... [id=eipalloc-08ca32ba6ca562c4a]
module.eks.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/demo-cluster/cluster]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 1s [id=2830595799]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
aws_iam_policy.eks_read_only_policy: Refreshing state... [id=arn:aws:iam::743683883645:policy/eks-read-only-policy]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=743683883645]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=743683883645]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
aws_iam_policy.eks_admin_policy: Refreshing state... [id=arn:aws:iam::743683883645:policy/eks-admin-policy]
module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.aws_iam_role.this[0]: Refreshing state... [id=demo-cluster-cluster-20250525195531986400000001]
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=743683883645]
aws_iam_role.eks_read_only: Refreshing state... [id=eks-read-only]
aws_iam_role.eks_admin: Refreshing state... [id=eks-admin]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::743683883645:policy/demo-cluster-cluster-20250525195531986400000002]
aws_iam_access_key.eks_admin: Refreshing state... [id=AKIA22JYDQJ63OOEWF77]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::743683883645:assumed-role/atlantis-demo-atlantis-role/1748210079341185612]
aws_internet_gateway.igw: Refreshing state... [id=igw-0314c88bb95335afc]
aws_subnet.private_2: Refreshing state... [id=subnet-049052abd9d2072d0]
aws_subnet.private_1: Refreshing state... [id=subnet-0b1ea8fcb18cd1051]
aws_subnet.public_1: Refreshing state... [id=subnet-06bdf2deb46fe0d72]
aws_subnet.public_2: Refreshing state... [id=subnet-0570a1e6c5d4d04eb]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0b339b2cefc28fb8d]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0290edeeec43b8139]
aws_iam_role_policy_attachment.eks_read_only_custom: Refreshing state... [id=eks-read-only-20250525211525626800000002]
aws_iam_role_policy_attachment.eks_admin_role_policy: Refreshing state... [id=eks-admin-20250525211525611500000001]
aws_iam_user_policy.eks_admin_assume_role: Refreshing state... [id=eks-admin-user:eks-admin-assume-role]
aws_route_table.public: Refreshing state... [id=rtb-0c03a3d8de4ddab99]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=demo-cluster-cluster-20250525195531986400000001-20250525195533143900000007]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=demo-cluster-cluster-20250525195531986400000001-20250525195533136000000006]
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=demo-cluster-cluster-20250525195531986400000001-20250525195533151500000008]
aws_nat_gateway.nat_1: Refreshing state... [id=nat-0b628eeef58d2ad59]
aws_nat_gateway.nat_2: Refreshing state... [id=nat-033f42133c20c4f7f]
aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-0ddf278a2f76daf7d]
aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-027156b44c4a132b2]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2502591802]
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1752150277]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=6d694edb-6255-4a2f-af34-be2e2dbc5151]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=743683883645]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-925529134]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-321566440]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-398215854]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1543705147]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1382687084]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-630664834]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-919278241]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-334938700]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-740106398]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1276909245]
aws_route_table.private_2: Refreshing state... [id=rtb-0240f5de01d0a9afc]
aws_route_table.private_1: Refreshing state... [id=rtb-083a916af4b14b797]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/demo-cluster]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::743683883645:policy/demo-cluster-cluster-ClusterEncryption20250525195553886000000012]
module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-2025052519554573820000000d]
aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-0104e8bb5eda40156]
aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-099fae7333aa2536f]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=demo-cluster]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=demo-cluster-cluster-20250525195531986400000001-20250525195554553400000013]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-2025052519554573820000000d-20250525195549048500000010]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-2025052519554573820000000d-20250525195549135900000011]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-2025052519554573820000000d-2025052519554879600000000f]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=default-eks-node-group-2025052519554573820000000d-2025052519554874360000000e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_access_key.eks_read_only will be created
  + resource "aws_iam_access_key" "eks_read_only" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "eks-read-only-user"
    }

  # aws_iam_role.eks_read_only will be updated in-place
  ~ resource "aws_iam_role" "eks_read_only" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "*" -> "arn:aws:iam::743683883645:root"
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "eks-read-only"
        name                  = "eks-read-only"
      ~ tags                  = {
          + "Name" = "eks-read-only"
        }
      ~ tags_all              = {
          + "Name" = "eks-read-only"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_iam_user.eks_read_only will be created
  + resource "aws_iam_user" "eks_read_only" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "eks-read-only-user"
      + path          = "/"
      + tags          = {
          + "Name" = "eks-read-only"
        }
      + tags_all      = {
          + "Name" = "eks-read-only"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy.eks_read_only_assume_role will be created
  + resource "aws_iam_user_policy" "eks_read_only_assume_role" {
      + id          = (known after apply)
      + name        = "eks-read-only-assume-role"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::743683883645:role/eks-read-only"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user        = "eks-read-only-user"
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "6d694edb-6255-4a2f-af34-be2e2dbc5151"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::743683883645:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::743683883645:root" -> "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::743683883645:role/demo-cluster-cluster-20250525195531986400000001"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment"           = "dev"
            "Project"               = "atlantis-demo"
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.
╷
│ Error: "0.0.0/0/32" is not a valid CIDR block: invalid CIDR address: 0.0.0/0/32
│ 
│   with module.eks.aws_eks_cluster.this[0],
│   on .terraform/modules/eks/main.tf line 71, in resource "aws_eks_cluster" "this":
│   71:     public_access_cidrs     = var.cluster_endpoint_public_access_cidrs
│ 
╵


```
</details>